
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>变量，作用域和内存 · 小仙女的读书笔记</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        <meta name="identifier" content="小仙女的读书笔记" scheme="ISBN">
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="02.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../js_functional/">
            
                <a href="../js_functional/">
            
                    
                    Javascript函数式编程
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../js_functional/01.html">
            
                <a href="../js_functional/01.html">
            
                    
                    变量的作用域和闭包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../js_functional/02.html">
            
                <a href="../js_functional/02.html">
            
                    
                    高阶函数
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../js_the_good_part/">
            
                <a href="../js_the_good_part/">
            
                    
                    javascript语言精粹
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../js_the_good_part/02.html">
            
                <a href="../js_the_good_part/02.html">
            
                    
                    对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../js_the_good_part/01.html">
            
                <a href="../js_the_good_part/01.html">
            
                    
                    方法
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="./">
            
                <a href="./">
            
                    
                    Javascript高级程序设计
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.4.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    变量，作用域和内存
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    面向对象的程序设计与函数表达式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../http/">
            
                <a href="../http/">
            
                    
                    图解HTTP
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../http/01.html">
            
                <a href="../http/01.html">
            
                    
                    了解web及网络基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../http/02.html">
            
                <a href="../http/02.html">
            
                    
                    简单的http协议
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../http/04.html">
            
                <a href="../http/04.html">
            
                    
                    返回结果的http状态码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="../http/05.html">
            
                <a href="../http/05.html">
            
                    
                    与htpp协作的web服务器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.5" data-path="../http/06.html">
            
                <a href="../http/06.html">
            
                    
                    http首部
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.6" data-path="../http/07.html">
            
                <a href="../http/07.html">
            
                    
                    确保web安全的https
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.7" data-path="../http/11.html">
            
                <a href="../http/11.html">
            
                    
                    web的攻击技术
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >变量，作用域和内存</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x53D8;&#x91CF;&#xFF0C;&#x4F5C;&#x7528;&#x57DF;&#x548C;&#x5185;&#x5B58;">&#x53D8;&#x91CF;&#xFF0C;&#x4F5C;&#x7528;&#x57DF;&#x548C;&#x5185;&#x5B58;</h1>
<h2 id="&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x503C;&#x548C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x503C;">&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x503C;&#x548C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x503C;</h2>
<p>&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF1A;Undefined&#xFF0C;Null&#xFF0C;Boolean&#xFF0C;Number&#x548C;String
&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF1A;object&#xFF0C;&#x51FD;&#x6570;&#xFF0C;&#x6570;&#x7EC4;&#xFF0C;</p>
<h2 id="&#x7279;&#x70B9;">&#x7279;&#x70B9;</h2>
<pre class="language-"><code>1. &#x57FA;&#x672C;&#x7C7B;&#x578B;&#x503C;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x5360;&#x636E;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x56E0;&#x6B64;&#x88AB;&#x4FDD;&#x5B58;&#x5728;&#x6808;&#x5185;&#x5B58;&#x4E2D;
2. &#x4ECE;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x590D;&#x5236;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x4F1A;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x503C;&#x7684;&#x4E00;&#x4E2A;&#x526F;&#x672C;
3. &#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x662F;&#x5BF9;&#x8C61;&#xFF0C;&#x4FDD;&#x5B58;&#x5728;&#x5806;&#x5185;&#x5B58;&#x4E2D;
4. &#x5305;&#x542B;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x503C;&#x7684;&#x53D8;&#x91CF;&#x5B9E;&#x9645;&#x4E0A;&#x5305;&#x542B;&#x7684;&#x5E76;&#x4E0D;&#x662F;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x6307;&#x9488;
5. &#x4ECE;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x590D;&#x5236;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x590D;&#x5236;&#x7684;&#x5176;&#x5B9E;&#x662F;&#x6307;&#x9488;&#xFF0C;&#x56E0;&#x6B64;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x6700;&#x7EC8;&#x90FD;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;
6. &#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x503C;&#x662F;&#x54EA;&#x79CD;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;typeof&#x64CD;&#x4F5C;&#x7B26;&#xFF0C;&#x800C;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x503C;&#x662F;&#x54EA;&#x79CD;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;instanceof&#x64CD;&#x4F5C;&#x7B26;
</code></pre><p>&#x6240;&#x6709;&#x53D8;&#x91CF;&#xFF08;&#x5305;&#x62EC;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x548C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF09;&#x90FD;&#x5B58;&#x5728;&#x4E8E;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x4F5C;&#x7528;&#x57DF;&#xFF09;&#x5F53;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x6267;&#x884C;&#x73AF;&#x5883;&#x51B3;&#x5B9A;&#x4E86;&#x53D8;&#x91CF;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x4EE5;&#x53CA;&#x54EA;&#x4E00;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5176;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x3002;</p>
<h2 id="&#x6267;&#x884C;&#x73AF;&#x5883;">&#x6267;&#x884C;&#x73AF;&#x5883;</h2>
<pre class="language-"><code>1. &#x6267;&#x884C;&#x73AF;&#x5883;&#x6709;&#x5168;&#x5C40;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x5168;&#x5C40;&#x73AF;&#x5883;&#xFF09;&#x548C;&#x51FD;&#x6570;&#x6267;&#x884C;&#x73AF;&#x5883;&#x4E4B;&#x5206;
2. &#x6BCF;&#x6B21;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF0C;&#x90FD;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x641C;&#x7D22;&#x53D8;&#x91CF;&#x548C;&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x94FE;
3. &#x51FD;&#x6570;&#x7684;&#x5C40;&#x90E8;&#x73AF;&#x5883;&#x4E0D;&#x4EC5;&#x6709;&#x6743;&#x8BBF;&#x95EE;&#x51FD;&#x6570;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x6743;&#x8BBF;&#x95EE;&#x5176;&#x5305;&#x542B;&#xFF08;&#x7236;&#xFF09;&#x73AF;&#x5883;&#xFF0C;&#x4E43;&#x81F3;&#x5168;&#x5C40;&#x73AF;&#x5883;
4. &#x5168;&#x5C40;&#x73AF;&#x5883;&#x53EA;&#x80FD;&#x8BBF;&#x95EE;&#x5728;&#x5168;&#x5C40;&#x73AF;&#x5883;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x548C;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x5C40;&#x90E8;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x6570;&#x636E;
5. &#x53D8;&#x91CF;&#x7684;&#x6267;&#x884C;&#x73AF;&#x5883;&#x6709;&#x52A9;&#x4E8E;&#x786E;&#x5B9A;&#x5E94;&#x8BE5;&#x4F55;&#x65F6;&#x91CA;&#x653E;&#x5185;&#x5B58;
</code></pre><h2 id="&#x5783;&#x573E;&#x6536;&#x96C6;">&#x5783;&#x573E;&#x6536;&#x96C6;</h2>
<pre class="language-"><code>1. &#x79BB;&#x5F00;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x503C;&#x5C06;&#x88AB;&#x81EA;&#x52A8;&#x6807;&#x8BB0;&#x4E3A;&#x53EF;&#x4EE5;&#x56DE;&#x6536;&#xFF0C;&#x56E0;&#x6B64;&#x5C06;&#x5728;&#x5783;&#x573E;&#x6536;&#x96C6;&#x671F;&#x95F4;&#x88AB;&#x5220;&#x9664;
2. &#x201C;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x201D;&#x662F;&#x76EE;&#x524D;&#x4E3B;&#x6D41;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#xFF0C;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x7684;&#x601D;&#x60F3;&#x662F;&#x7ED9;&#x5F53;&#x524D;&#x4E0D;&#x4F7F;&#x7528;&#x7684;&#x503C;&#x52A0;&#x4E0A;&#x6807;&#x8BB0;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x56DE;&#x6536;&#x5176;&#x5185;&#x5B58;
3. &#x53E6;&#x4E00;&#x79CD;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#x662F;&#x201C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x201D;&#xFF0C;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x7684;&#x601D;&#x60F3;&#x662F;&#x8DDF;&#x8E2A;&#x8BB0;&#x5F55;&#x6240;&#x6709;&#x503C;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x6B21;&#x6570;&#xFF0C;
4. &#x5F53;&#x4EE3;&#x7801;&#x4E2D;&#x5B58;&#x5728;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x73B0;&#x8C61;&#x65F6;&#xFF0C;&#x201C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x201D;&#x7B97;&#x6CD5;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x95EE;&#x9898;
5. &#x89E3;&#x9664;&#x53D8;&#x91CF;&#x7684;&#x5F15;&#x7528;&#x4E0D;&#x4EC5;&#x6709;&#x52A9;&#x4E8E;&#x6D88;&#x9664;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x73B0;&#x8C61;&#xFF0C;&#x800C;&#x4E14;&#x5BF9;&#x5783;&#x573E;&#x6536;&#x96C6;&#x4E5F;&#x6709;&#x597D;&#x5904;&#xFF0C;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x6709;&#x6548;&#x7684;&#x56DE;&#x6536;&#x5185;&#x5B58;&#xFF0C;&#x5E94;&#x8BE5;&#x53CA;&#x65F6;&#x89E3;&#x9664;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x7684;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#xFF0C;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x5C5E;&#x6027;&#x4EE5;&#x53CA;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x53D8;&#x91CF;&#x7684;&#x5F15;&#x7528;
</code></pre><h2 id="&#x5F15;&#x7528;&#x7C7B;&#x578B;">&#x5F15;&#x7528;&#x7C7B;&#x578B;</h2>
<pre class="language-"><code>1. &#x5F15;&#x7528;&#x7C7B;&#x578B;&#x4E0E;&#x4F20;&#x7EDF;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x7C7B;&#x76F8;&#x4F3C;&#xFF0C;&#x4F46;&#x5B9E;&#x73B0;&#x4E0D;&#x540C;
2. Oject&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x7840;&#x7C7B;&#x578B;&#xFF0C;&#x5176;&#x5B83;&#x6240;&#x6709;&#x7C7B;&#x578B;&#x90FD;&#x4ECE;Object&#x7EE7;&#x627F;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x884C;&#x4E3A;
3. Array&#x7C7B;&#x578B;&#x662F;&#x4E00;&#x7EC4;&#x503C;&#x7684;&#x6709;&#x5E8F;&#x5217;&#x8868;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x64CD;&#x4F5C;&#x548C;&#x8F6C;&#x6362;&#x8FD9;&#x4E9B;&#x503C;&#x7684;&#x529F;&#x80FD;
4. Date&#x7C7B;&#x578B;&#x63D0;&#x4F9B;&#x4E86;&#x6709;&#x5173;&#x65E5;&#x671F;&#x548C;&#x65F6;&#x95F4;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x5F53;&#x524D;&#x65E5;&#x671F;&#x548C;&#x65F6;&#x95F4;&#x4EE5;&#x53CA;&#x76F8;&#x5173;&#x7684;&#x8BA1;&#x7B97;&#x529F;&#x80FD;
5. RegExp&#x7C7B;&#x578B;&#x662F;ECMAScript&#x652F;&#x6301;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x6700;&#x57FA;&#x672C;&#x7684;&#x548C;&#x4E00;&#x4E9B;&#x9AD8;&#x7EA7;&#x7684;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x529F;&#x80FD;
6. &#x51FD;&#x6570;&#x5B9E;&#x9645;&#x4E0A;&#x662F;Function&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x56E0;&#x6B64;&#x51FD;&#x6570;&#x4E5F;&#x662F;&#x5BF9;&#x8C61;&#x3002;&#x7531;&#x4E8E;&#x51FD;&#x6570;&#x662F;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x51FD;&#x6570;&#x4E5F;&#x62E5;&#x6709;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x589E;&#x5F3A;&#x5176;&#x884C;&#x4E3A;&#x3002;&#x56E0;&#x4E3A;&#x6709;&#x4E86;&#x57FA;&#x672C;&#x5305;&#x88C5;&#x7C7B;&#x578B;&#xFF0C;&#x6240;&#x4EE5;js&#x4E2D;&#x7684;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x503C;&#x53EF;&#x4EE5;&#x88AB;&#x5F53;&#x4F5C;&#x5BF9;&#x8C61;&#x6765;&#x8BBF;&#x95EE;&#x3002;&#x4E09;&#x79CD;&#x57FA;&#x672C;&#x5305;&#x88C5;&#x7C7B;&#x578B;&#x5206;&#x522B;&#x4E3A;&#xFF1A;Boolean&#xFF0C;Number&#x548C;String&#x3002;&#x7279;&#x5F81;&#xFF1A;
    &#x6BCF;&#x4E2A;&#x5305;&#x88C5;&#x7C7B;&#x578B;&#x90FD;&#x6620;&#x5C04;&#x5230;&#x540C;&#x540D;&#x7684;&#x57FA;&#x672C;&#x7C7B;&#x578B;
    &#x5728;&#x8BFB;&#x53D6;&#x6A21;&#x5F0F;&#x4E0B;&#x8BBF;&#x95EE;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x503C;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x521B;&#x5EFA;&#x5BF9;&#x5E94;&#x7684;&#x57FA;&#x672C;&#x5305;&#x88C5;&#x7C7B;&#x578B;&#x7684;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x4ECE;&#x800C;&#x65B9;&#x4FBF;&#x4E86;&#x6570;&#x636E;&#x64CD;&#x4F5C;
    &#x64CD;&#x4F5C;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x503C;&#x7684;&#x8BED;&#x53E5;&#x4E00;&#x7ECF;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#xFF0C;&#x5C31;&#x4F1A;&#x7ACB;&#x5373;&#x9500;&#x6BC1;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x5305;&#x88C5;&#x5BF9;&#x8C61;
</code></pre><p>&#x5728;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x4E4B;&#x524D;&#xFF0C;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x5C31;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E24;&#x4E2A;&#x5185;&#x7F6E;&#x5BF9;&#x8C61;&#xFF1A;Global&#x548C;Math&#xFF1B;</p>
<p>web&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#x4E86;&#x53EF;&#x8BBF;&#x95EE;Global&#x5BF9;&#x8C61;&#x7684;&#x662F;window&#x5BF9;&#x8C61;</p>
<p>&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x51FD;&#x6570;&#x90FD;&#x662F;Global&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x3002;Math&#x5BF9;&#x8C61;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x7528;&#x4E8E;&#x8F85;&#x52A9;&#x5B8C;&#x6210;&#x590D;&#x6742;&#x7684;&#x6570;&#x5B66;&#x8BA1;&#x7B97;&#x4EFB;&#x52A1;</p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> caicai&#xA0;&#x7248;&#x6743;&#x6240;&#x6709;&#xA0;&#xA0;https://github.com/shmilyCai/reading </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> <span>&#x8BE5;&#x6587;&#x4EF6;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;</span> 2018-12-05 12:46:35 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Javascript高级程序设计">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="02.html" class="navigation navigation-next " aria-label="Next page: 面向对象的程序设计与函数表达式">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"变量，作用域和内存","level":"1.4.1","depth":2,"next":{"title":"面向对象的程序设计与函数表达式","level":"1.4.2","depth":2,"path":"js_professional/02.md","ref":"js_professional/02.md","articles":[]},"previous":{"title":"Javascript高级程序设计","level":"1.4","depth":1,"path":"js_professional/index.md","ref":"js_professional/index.md","articles":[{"title":"变量，作用域和内存","level":"1.4.1","depth":2,"path":"js_professional/01.md","ref":"js_professional/01.md","articles":[]},{"title":"面向对象的程序设计与函数表达式","level":"1.4.2","depth":2,"path":"js_professional/02.md","ref":"js_professional/02.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["page-footer-ex","prism","-highlight","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"fontState":{"size":"1","family":"sans","theme":"night"},"pluginsConfig":{"prism":{},"livereload":{},"page-footer-ex":{"copyright":"caicai&nbsp;版权所有&nbsp;&nbsp;https://github.com/shmilyCai/reading","markdown":false,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"<span>该文件修订时间</span>"},"search":{},"books":{"prism_themes":["prismjs/themes/prism-tomorrow.css"]},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"fontSettings":{"theme":"white","family":"msyh","size":2},"sharing":{"facebook":false,"twitter":false,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":[]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageBreaksBefore":"/","headerTemplate":null,"paperSize":"a4","margin":{"right":62,"left":62,"top":36,"bottom":36},"fontSize":10,"fontFamily":"Arial","footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"小仙女的读书笔记","variables":{},"title":"小仙女的读书笔记","links":{"sharing":{"all":false,"facebook":false,"google":false,"twitter":false,"weibo":false},"sidebar":{}},"gitbook":"*","description":"小仙女的读书笔记","extension":null},"file":{"path":"js_professional/01.md","mtime":"2018-12-05T04:46:35.565Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-05T05:19:27.909Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

