
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>面向对象的程序设计与函数表达式 · 小仙女的读书笔记</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        <meta name="identifier" content="小仙女的读书笔记" scheme="ISBN">
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../http/" />
    
    
    <link rel="prev" href="01.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../js_functional/">
            
                <a href="../js_functional/">
            
                    
                    Javascript函数式编程
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../js_functional/01.html">
            
                <a href="../js_functional/01.html">
            
                    
                    变量的作用域和闭包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../js_functional/02.html">
            
                <a href="../js_functional/02.html">
            
                    
                    高阶函数
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../js_the_good_part/">
            
                <a href="../js_the_good_part/">
            
                    
                    javascript语言精粹
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../js_the_good_part/02.html">
            
                <a href="../js_the_good_part/02.html">
            
                    
                    对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../js_the_good_part/01.html">
            
                <a href="../js_the_good_part/01.html">
            
                    
                    方法
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="./">
            
                <a href="./">
            
                    
                    Javascript高级程序设计
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    变量，作用域和内存
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    面向对象的程序设计与函数表达式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../http/">
            
                <a href="../http/">
            
                    
                    图解HTTP
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../http/01.html">
            
                <a href="../http/01.html">
            
                    
                    了解web及网络基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../http/02.html">
            
                <a href="../http/02.html">
            
                    
                    简单的http协议
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../http/04.html">
            
                <a href="../http/04.html">
            
                    
                    返回结果的http状态码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="../http/05.html">
            
                <a href="../http/05.html">
            
                    
                    与htpp协作的web服务器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.5" data-path="../http/06.html">
            
                <a href="../http/06.html">
            
                    
                    http首部
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.6" data-path="../http/07.html">
            
                <a href="../http/07.html">
            
                    
                    确保web安全的https
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.7" data-path="../http/11.html">
            
                <a href="../http/11.html">
            
                    
                    web的攻击技术
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >面向对象的程序设计与函数表达式</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x4E0E;&#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;">&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x4E0E;&#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;</h1>
<h2 id="&#x521B;&#x5EFA;&#x5BF9;&#x8C61;">&#x521B;&#x5EFA;&#x5BF9;&#x8C61;</h2>
<pre class="language-"><code>1. &#x5DE5;&#x5382;&#x6A21;&#x5F0F;
&#x4F7F;&#x7528;&#x7B80;&#x5355;&#x7684;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#xFF0C;&#x4E3A;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x5BF9;&#x8C61;

2. &#x6784;&#x9020;&#x51FD;&#x6570;
&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x81EA;&#x5B9A;&#x4E49;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF0C;&#x53EF;&#x4EE5;&#x50CF;&#x521B;&#x5EFA;&#x5185;&#x7F6E;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x4E00;&#x6837;&#x4F7F;&#x7528;new&#x64CD;&#x4F5C;&#x7B26;&#x3002;
&#x7F3A;&#x70B9;&#xFF1A;&#x7EA7;&#x5B83;&#x7684;&#x6BCF;&#x4E2A;&#x6210;&#x5458;&#x90FD;&#x65E0;&#x6CD5;&#x5F97;&#x5230;&#x590D;&#x7528;&#xFF0C;&#x5305;&#x62EC;&#x51FD;&#x6570;&#xFF0C;&#x5373;&#x4E0D;&#x5B58;&#x5728;&#x5171;&#x4EAB;&#x51FD;&#x6570;&#x3002;

3. &#x539F;&#x578B;&#x6A21;&#x5F0F;
&#x4F7F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;prototype&#x5C5E;&#x6027;&#x6765;&#x6307;&#x5B9A;&#x90A3;&#x4E9B;&#x5E94;&#x8BE5;&#x5171;&#x4EAB;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x3002;&#x7EC4;&#x5408;&#x4F7F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6A21;&#x5F0F;&#x548C;&#x539F;&#x578B;&#x6A21;&#x5F0F;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x5B9E;&#x4F8B;&#x5C5E;&#x6027;&#xFF0C;&#x800C;&#x4F7F;&#x7528;&#x539F;&#x578B;&#x5B9A;&#x4E49;&#x5171;&#x4EAB;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;
</code></pre><h2 id="&#x7EE7;&#x627F;">&#x7EE7;&#x627F;</h2>
<pre class="language-"><code>1. &#x539F;&#x578B;&#x94FE;&#x7EE7;&#x627F;
js&#x901A;&#x8FC7;&#x539F;&#x578B;&#x94FE;&#x5B9E;&#x73B0;&#x7EE7;&#x627F;&#x3002;
&#x539F;&#x578B;&#x94FE;&#x7684;&#x6784;&#x5EFA;&#x662F;&#x901A;&#x8FC7;&#x5C06;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F8B;&#x8D4B;&#x503C;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x539F;&#x578B;&#x5B9E;&#x73B0;&#x7684;&#x3002;
&#x8FD9;&#x6837;&#xFF0C;&#x5B50;&#x7C7B;&#x578B;&#x5C31;&#x80FD;&#x591F;&#x8BBF;&#x95EE;&#x8D85;&#x7C7B;&#x578B;&#x7684;&#x6240;&#x6709;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x3002;
&#x539F;&#x578B;&#x94FE;&#x7684;&#x95EE;&#x9898;&#x662F;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x5171;&#x4EAB;&#x6240;&#x6709;&#x7EE7;&#x627F;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x9002;&#x5B9C;&#x5355;&#x72EC;&#x4F7F;&#x7528;&#x3002;
&#x501F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x5373;&#x5728;&#x5B50;&#x7C7B;&#x578B;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x5185;&#x90E8;&#x8C03;&#x7528;&#x8D85;&#x7C7B;&#x578B;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x90FD;&#x5177;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x80FD;&#x4FDD;&#x8BC1;&#x53EA;&#x4F7F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6A21;&#x5F0F;&#x6765;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x3002;&#x4F7F;&#x7528;&#x6700;&#x591A;&#x7684;&#x7EE7;&#x627F;&#x6A21;&#x5F0F;&#x662F;&#x7EC4;&#x5408;&#x7EE7;&#x627F;&#xFF0C;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x4F7F;&#x7528;&#x539F;&#x578B;&#x94FE;&#x7EE7;&#x627F;&#x5171;&#x4EAB;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x901A;&#x8FC7;&#x501F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7EE7;&#x627F;&#x5B9E;&#x4F8B;&#x5C5E;&#x6027;

2. &#x539F;&#x578B;&#x5F0F;&#x7EE7;&#x627F;
&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x5FC5;&#x987B;&#x9884;&#x5148;&#x5B9A;&#x4E49;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B9E;&#x73B0;&#x7EE7;&#x627F;&#xFF0C;&#x5176;&#x672C;&#x8D28;&#x662F;&#x6267;&#x884C;&#x5BF9;&#x7ED9;&#x5B9A;&#x5BF9;&#x8C61;&#x7684;&#x6D45;&#x590D;&#x5236;&#x3002;&#x800C;&#x590D;&#x5236;&#x5F97;&#x5230;&#x7684;&#x526F;&#x672C;&#x8FD8;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x8FDB;&#x4E00;&#x6B65;&#x6539;&#x9020;

3. &#x5BC4;&#x751F;&#x5F0F;&#x7EE7;&#x627F;
&#x4E0E;&#x539F;&#x578B;&#x5F0F;&#x7EE7;&#x627F;&#x76F8;&#x4F3C;&#xFF0C;&#x4E5F;&#x662F;&#x57FA;&#x4E8E;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x6216;&#x8005;&#x67D0;&#x4E9B;&#x4FE1;&#x606F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x589E;&#x5F3A;&#x5BF9;&#x8C61;&#xFF0C;&#x6700;&#x540E;&#x8FD4;&#x56DE;&#x5BF9;&#x8C61;&#x3002;
&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x7EC4;&#x5408;&#x7EE7;&#x627F;&#x6A21;&#x5F0F;&#x7531;&#x4E8E;&#x591A;&#x6B21;&#x8C03;&#x7528;&#x8D85;&#x7C7B;&#x578B;&#x6784;&#x9020;&#x51FD;&#x6570;&#x800C;&#x5BFC;&#x81F4;&#x7684;&#x4F4E;&#x6548;&#x7387;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x4E0E;&#x7EC4;&#x5408;&#x7EE7;&#x627F;&#x4E00;&#x8D77;&#x4F7F;&#x7528;

4. &#x5BC4;&#x751F;&#x7EC4;&#x5408;&#x5F0F;&#x7EE7;&#x627F;
&#x96C6;&#x5BC4;&#x751F;&#x5F0F;&#x7EE7;&#x627F;&#x548C;&#x7EC4;&#x5408;&#x7EE7;&#x627F;&#x7684;&#x6709;&#x70B9;&#x4E0E;&#x4E00;&#x8EAB;&#xFF0C;&#x662F;&#x5B9E;&#x73B0;&#x57FA;&#x4E8E;&#x7C7B;&#x578B;&#x7EE7;&#x627F;&#x7684;&#x6700;&#x6709;&#x6548;&#x65B9;&#x5F0F;
</code></pre><h2 id="&#x51FD;&#x6570;&#x58F0;&#x660E;">&#x51FD;&#x6570;&#x58F0;&#x660E;</h2>
<p>&#x91CD;&#x8981;&#x7279;&#x5F81;&#xFF1A;&#x5728;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x4E4B;&#x524D;&#x4F1A;&#x5148;&#x8BFB;&#x53D6;&#x51FD;&#x6570;&#x58F0;&#x660E;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x628A;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x653E;&#x5728;&#x8C03;&#x7528;&#x5B83;&#x7684;&#x8BED;&#x53E5;&#x540E;&#x9762;</p>
<pre class="language-"><code>//&#x51FD;&#x6570;&#x58F0;&#x660E;
function name(){}
</code></pre><h2 id="&#x51FD;&#x6570;&#x58F0;&#x660E;&#x4E0E;&#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;">&#x51FD;&#x6570;&#x58F0;&#x660E;&#x4E0E;&#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;</h2>
<p>&#x770B;&#x8D77;&#x6765;&#x597D;&#x50CF;&#x662F;&#x5E38;&#x89C4;&#x7684;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x8BED;&#x53E5;&#xFF0C;&#x5373;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5E76;&#x5C06;&#x5B83;&#x8D4B;&#x503C;&#x7ED9;&#x53D8;&#x91CF;functionName&#xFF0C;&#x521B;&#x5EFA;&#x7684;&#x51FD;&#x6570;&#x79F0;&#x4E3A;&#x533F;&#x540D;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;&#x5728;&#x4F7F;&#x7528;&#x524D;&#x5FC5;&#x987B;&#x5148;&#x8D4B;&#x503C;&#x3002;</p>
<pre class="language-"><code>
//&#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;
var name = function(){}
</code></pre><p>&#x7279;&#x70B9;&#xFF1A;</p>
<pre class="language-"><code>1. &#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x540C;&#x4E8E;&#x51FD;&#x6570;&#x58F0;&#x660E;&#xFF0C;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x8981;&#x6C42;&#x6709;&#x540D;&#x5B57;&#xFF0C;&#x4F46;&#x662F;&#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x9700;&#x8981;&#xFF0C;&#x6CA1;&#x6709;&#x540D;&#x5B57;&#x7684;&#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;&#x4E5F;&#x53EB;&#x505A;&#x533F;&#x540D;&#x51FD;&#x6570;
2. &#x5728;&#x65E0;&#x6CD5;&#x786E;&#x5B9A;&#x5982;&#x4F55;&#x5F15;&#x7528;&#x51FD;&#x6570;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x6BD4;&#x8F83;&#x590D;&#x6742;
3. &#x9012;&#x5F52;&#x51FD;&#x6570;&#x5E94;&#x8BE5;&#x59CB;&#x7EC8;&#x4F7F;&#x7528;argument.callee&#x6765;&#x9012;&#x5F52;&#x7684;&#x8C03;&#x7528;&#x81EA;&#x8EAB;&#xFF0C;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x540D;&#xFF0C;&#x51FD;&#x6570;&#x540D;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;
</code></pre><h2 id="&#x95ED;&#x5305;">&#x95ED;&#x5305;</h2>
<p>&#x5F53;&#x5728;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x5B9A;&#x4E49;&#x4E86;&#x5176;&#x5B83;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x5C31;&#x521B;&#x5EFA;&#x4E86;&#x95ED;&#x5305;&#x3002;</p>
<p>&#x95ED;&#x5305;&#x6709;&#x6743;&#x8BBF;&#x95EE;&#x5305;&#x542B;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x7684;&#x6240;&#x6709;&#x53D8;&#x91CF;</p>
<p>&#x539F;&#x7406;&#xFF1A;</p>
<pre class="language-"><code>1. &#x5728;&#x540E;&#x53F0;&#x6267;&#x884C;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x95ED;&#x5305;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x5305;&#x542B;&#x7740;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x5305;&#x542B;&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x548C;&#x5168;&#x5C40;&#x4F5C;&#x7528;&#x57DF;
2. &#x901A;&#x5E38;&#xFF0C;&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x53CA;&#x5176;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x90FD;&#x4F1A;&#x5728;&#x51FD;&#x6570;&#x6267;&#x884C;&#x7ED3;&#x675F;&#x540E;&#x88AB;&#x9500;&#x6BC1;
3. &#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x4E86;&#x4E00;&#x4E2A;&#x95ED;&#x5305;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x5C06;&#x4F1A;&#x4E00;&#x76F4;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x4FDD;&#x5B58;&#x5230;&#x95ED;&#x5305;&#x4E0D;&#x5B58;&#x5728;&#x4E3A;&#x6B62;
</code></pre><p>&#x4F7F;&#x7528;&#x95ED;&#x5305;&#x53EF;&#x4EE5;&#x5728;js&#x4E2D;&#x6A21;&#x4EFF;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x8981;&#x70B9;&#xFF1A;</p>
<pre class="language-"><code>1. &#x521B;&#x5EFA;&#x5E76;&#x7ACB;&#x5373;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x6837;&#x65E2;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x5176;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x53C8;&#x4E0D;&#x4F1A;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7559;&#x4E0B;&#x5BF9;&#x8BE5;&#x51FD;&#x6570;&#x7684;&#x5F15;&#x7528;
2. &#x7ED3;&#x679C;&#x5C31;&#x662F;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x7684;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x90FD;&#x4F1A;&#x88AB;&#x7ACB;&#x5373;&#x9500;&#x6BC1;&#xFF0C;&#x9664;&#x975E;&#x67D0;&#x4E9B;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x7ED9;&#x4E86;&#x5305;&#x542B;&#x4F5C;&#x7528;&#x57DF;&#xFF08;&#x5373;&#x5916;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#xFF09;&#x4E2D;&#x7684;&#x53D8;&#x91CF;
</code></pre><p>&#x4F7F;&#x7528;&#x95ED;&#x5305;&#x53EF;&#x7528;&#x4E8E;&#x5728;&#x5BF9;&#x8C61;&#x4E2D;&#x521B;&#x5EFA;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#xFF0C;&#x8981;&#x70B9;&#xFF1A;</p>
<pre class="language-"><code>1. js&#x4E2D;&#x6CA1;&#x6709;&#x6B63;&#x5F0F;&#x7684;&#x79C1;&#x6709;&#x5BF9;&#x8C61;&#x5C5E;&#x6027;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x95ED;&#x5305;&#x6765;&#x5B9E;&#x73B0;&#x516C;&#x6709;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x901A;&#x8FC7;&#x516C;&#x6709;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5728;&#x5305;&#x542B;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;
2. &#x6709;&#x6743;&#x8BBF;&#x95EE;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#x7684;&#x516C;&#x6709;&#x65B9;&#x6CD5;&#x53EB;&#x7279;&#x6743;&#x65B9;&#x6CD5;
3. &#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6A21;&#x5F0F;&#xFF0C;&#x539F;&#x578B;&#x6A21;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x7684;&#x7279;&#x6743;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6A21;&#x5757;&#x6A21;&#x5F0F;&#xFF0C;&#x589E;&#x5F3A;&#x7684;&#x6A21;&#x5757;&#x6A21;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x5355;&#x4F8B;&#x7684;&#x7279;&#x6743;&#x65B9;&#x6CD5;
</code></pre><footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> caicai&#xA0;&#x7248;&#x6743;&#x6240;&#x6709;&#xA0;&#xA0;https://github.com/shmilyCai/reading </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> <span>&#x8BE5;&#x6587;&#x4EF6;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;</span> 2018-12-05 13:17:38 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="01.html" class="navigation navigation-prev " aria-label="Previous page: 变量，作用域和内存">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../http/" class="navigation navigation-next " aria-label="Next page: 图解HTTP">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"面向对象的程序设计与函数表达式","level":"1.4.2","depth":2,"next":{"title":"图解HTTP","level":"1.5","depth":1,"path":"http/index.md","ref":"http/index.md","articles":[{"title":"了解web及网络基础","level":"1.5.1","depth":2,"path":"http/01.md","ref":"http/01.md","articles":[]},{"title":"简单的http协议","level":"1.5.2","depth":2,"path":"http/02.md","ref":"http/02.md","articles":[]},{"title":"返回结果的http状态码","level":"1.5.3","depth":2,"path":"http/04.md","ref":"http/04.md","articles":[]},{"title":"与htpp协作的web服务器","level":"1.5.4","depth":2,"path":"http/05.md","ref":"http/05.md","articles":[]},{"title":"http首部","level":"1.5.5","depth":2,"path":"http/06.md","ref":"http/06.md","articles":[]},{"title":"确保web安全的https","level":"1.5.6","depth":2,"path":"http/07.md","ref":"http/07.md","articles":[]},{"title":"web的攻击技术","level":"1.5.7","depth":2,"path":"http/11.md","ref":"http/11.md","articles":[]}]},"previous":{"title":"变量，作用域和内存","level":"1.4.1","depth":2,"path":"js_professional/01.md","ref":"js_professional/01.md","articles":[]},"dir":"ltr"},"config":{"plugins":["page-footer-ex","prism","-highlight","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"fontState":{"size":"1","family":"sans","theme":"night"},"pluginsConfig":{"prism":{},"livereload":{},"page-footer-ex":{"copyright":"caicai&nbsp;版权所有&nbsp;&nbsp;https://github.com/shmilyCai/reading","markdown":false,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"<span>该文件修订时间</span>"},"search":{},"books":{"prism_themes":["prismjs/themes/prism-tomorrow.css"]},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"fontSettings":{"theme":"white","family":"msyh","size":2},"sharing":{"facebook":false,"twitter":false,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":[]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageBreaksBefore":"/","headerTemplate":null,"paperSize":"a4","margin":{"right":62,"left":62,"top":36,"bottom":36},"fontSize":10,"fontFamily":"Arial","footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"小仙女的读书笔记","variables":{},"title":"小仙女的读书笔记","links":{"sharing":{"all":false,"facebook":false,"google":false,"twitter":false,"weibo":false},"sidebar":{}},"gitbook":"*","description":"小仙女的读书笔记","extension":null},"file":{"path":"js_professional/02.md","mtime":"2018-12-05T05:17:38.173Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-05T05:19:27.909Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

